import { CardType } from "@widgets/modals-widget/analysis-modal/types/card.type.ts";

export const Cards: CardType[] = [
  {
    name: "№1. Шура — Любовь",
    colorName: "Зеленый.",
    description: "“Любовь” символизирует тепло, заботу и взаимное принятие. Эта карточка напоминает, что любовь делает нас лучше, помогает справляться с трудностями и вдохновляет. Она учит ценить близких и делиться своей добротой.",
  },
  {
    name: "№2. Шура — Нуждаться в заботе",
    colorName: "Желтый.",
    description: "“Нуждаться в заботе” показывает моменты, когда вам особенно важна поддержка и внимание. Эта карточка учит принимать заботу от других, напоминая, что все мы иногда нуждаемся в помощи и понимании.",
  },
  {
    name: "№3. Шура — Безответственность",
    colorName: "Красный.",
    description: "“Безответственность” отражает ситуации, когда вы избегаете своих обязанностей или не задумываетесь о последствиях своих действий. Эта карточка учит осознавать ответственность за свои поступки и находить баланс между свободой и обязанностями.",
  },
  {
    name: "№4. Эдуард — Забота",
    colorName: "Зеленый.",
    description: "“Забота” символизирует умение проявлять внимание и помогать окружающим. Эта карточка напоминает, что забота о других делает нас добрее и помогает укреплять отношения. Она учит замечать, когда кому-то нужна поддержка, и действовать искренне.",
  },
  {
    name: "№5. Эдуард — Попасть в беду",
    colorName: "Желтый.",
    description: "“Попасть в беду” отражает ситуации, в которых вам сложно справиться самостоятельно. Эта карточка учит осознавать такие моменты и вовремя искать помощь. Она напоминает, что даже из сложных ситуаций всегда можно найти выход с поддержкой окружающих.",
  },
  {
    name: "№6. Эдуард — Обман",
    colorName: "Красный.",
    description: "“Обман” символизирует нечестное поведение или манипуляции. Эта карточка напоминает, что доверие легко потерять, но сложно восстановить. Она учит важности честности и уважения в отношениях с окружающими.",
  },
  {
    name: "№7. Рик— Чистоплотность",
    colorName: "Зеленый.",
    description: "“Чистоплотность” отражает заботу о себе и своем окружении. Эта карточка напоминает, что чистота и порядок помогают чувствовать себя комфортно и уверенно. Она вдохновляет на регулярный уход за собой и своим пространством.",
  },
  {
    name: "№8. Рик — В плохой компании",
    colorName: "Желтый.",
    description: "“В плохой компании” указывает на влияние, которое оказывают окружающие. Эта карточка учит анализировать, кто находится рядом с вами, и избегать токсичных людей. Она напоминает, что правильный выбор окружения помогает оставаться собой.",
  },
  {
    name: "№9. Рик — Грубость",
    colorName: "Красный.",
    description: "“Грубость” символизирует проявления злости или невнимательности в общении. Эта карточка напоминает, что слова могут ранить, и важно следить за своим тоном. Она учит уважению к окружающим и умению выражать эмоции конструктивно.",
  },
  {
    name: "№10. Агата — Щедрость",
    colorName: "Зеленый.",
    description: "“Щедрость” — это готовность делиться своими ресурсами, временем или заботой с окружающими. Эта карточка напоминает, что щедрость помогает строить теплые отношения и делает мир лучше. Она вдохновляет на искреннюю помощь и поддержку, которая возвращается сторицей.",
  },
  {
    name: "№11. Агата — Нуждаться в подсказке",
    colorName: "Желтый.",
    description: "“Нуждаться в подсказке” отражает моменты, когда вы теряетесь и не знаете, как поступить. Эта карточка напоминает, что обратиться за советом — это нормально. Она учит, что иногда помощь со стороны помогает увидеть решение, которое раньше было незаметно.",
  },
  {
    name: "№12. Агата — Обидчивость",
    colorName: "Красный.",
    description: "“Обидчивость” показывает, как легко вы можете обидеться из-за слов или поступков других. Эта карточка напоминает, что важно уметь анализировать свои чувства и не торопиться с выводами. Она учит быть более устойчивым и находить способы прощать.",
  },
  {
    name: "№13. Чука — Мудрость",
    colorName: "Зеленый.",
    description: "“Мудрость” символизирует способность находить правильные решения, основанные на опыте и понимании ситуации. Эта карточка вдохновляет на осознанные действия и глубокое восприятие мира. Она учит спокойствию и рассудительности.",
  },
  {
    name: "№14. Чука — Потерять мечту",
    colorName: "Желтый.",
    description: "“Потерять мечту” отражает моменты разочарования, когда вы чувствуете, что ваши цели становятся недостижимыми. Эта карточка напоминает, что мечты всегда можно пересмотреть или найти новые. Она учит, что каждый шаг вперед приближает к чему-то важному.",
  },
  {
    name: "№15. Чука — Лень",
    colorName: "Красный.",
    description: "Лень” показывает момент, когда вам сложно найти силы для действия. Эта карточка напоминает, что лень — это не враг, а сигнал о том, что нужно пересмотреть свои приоритеты или восстановить энергию. Она учит искать баланс между отдыхом и активностью.",
  },
  {
    name: "№16. Боб — Энергичность",
    colorName: "Зеленый.",
    description: "“Энергичность” символизирует силу, активность и желание действовать. Эта карточка вдохновляет на достижение целей и напоминает, что энергия — это ключ к новым свершениям. Она учит использовать свои силы разумно, чтобы достичь успеха.",
  },
  {
    name: "№17. Боб — Сказать “Нет”",
    colorName: "Желтый.",
    description: "“Сказать ‘Нет’” показывает важность умения отстаивать свои границы. Эта карточка напоминает, что иногда отказываться — это нормально, если что-то вам не подходит или некомфортно. Она учит быть уверенным в своих решениях и уважать себя.",
  },
  {
    name: "№18. Боб — Хвастовство",
    colorName: "Красный.",
    description: "“Хвастовство” показывает момент, когда человек пытается привлечь к себе внимание за счет преувеличения своих заслуг. Эта карточка напоминает, что важно быть честным с собой и окружающими. Она учит, что гордиться собой — это нормально, но не стоит забывать о чувствах других и перебарщивать с похвалой самому себе.",
  },
  {
    name: "№19. Котовский — Любознательность",
    colorName: "Зеленый.",
    description: "Любознательность” — это желание узнавать новое и исследовать окружающий мир. Эта карточка вдохновляет задавать вопросы, учиться и не бояться экспериментировать. Она напоминает, что именно благодаря любознательности мы можем находить интересное в самых обычных вещах.",
  },
  {
    name: "№20. Котовский — Нуждаться в защите",
    colorName: "Желтый.",
    description: "“Нуждаться в защите” символизирует момент, когда вы чувствуете себя уязвимым. Эта карточка напоминает, что иногда всем нужна помощь и поддержка. Она учит, что в признании своей слабости нет ничего плохого — это первый шаг к тому, чтобы найти решение или попросить о помощи.",
  },
  {
    name: "№21. Котовский — Жадность",
    colorName: "Красный.",
    description: "“Жадность” отражает состояние, когда человек хочет забрать больше, чем ему нужно, забывая о других. Эта карточка напоминает, что щедрость и умение делиться — важные качества, которые делают нас лучше. Она учит осознавать, что счастье приходит не от количества, а от умения делиться с окружающими.",
  },
  {
    name: "№22. Моня — Сочувствие",
    colorName: "Зеленый.",
    description: "“Сочувствие” — это умение чувствовать то, что переживают другие люди. Эта карточка напоминает, что сочувствие делает нас добрее и помогает строить доверительные отношения. Она учит замечать, когда кто-то нуждается в поддержке, и быть рядом, даже если вы не можете полностью понять чужие переживания.",
  },
  {
    name: "№23. Моня — Выбиться из сил",
    colorName: "Желтый.",
    description: "“Выбиться из сил” — это состояние, когда вы устали и больше не можете продолжать. Эта карточка напоминает, что важно заботиться о себе, делать паузы и восстанавливать силы. Она учит, что отдых — это не слабость, а необходимая часть любого пути.",
  },
  {
    name: "№24. Моня — Зависть",
    colorName: "Красный.",
    description: "“Зависть” — это чувство, когда вы хотите то, что есть у другого человека, и не радуетесь за него. Эта карточка учит, что зависть — сигнал для размышлений: что именно вы хотите изменить в своей жизни? Она напоминает, что работать над своими желаниями и целями важнее, чем сравнивать себя с другими.",
  },
  {
    name: "№25. Флокси — Интуиция",
    colorName: "Зеленый.",
    description: "“Интуиция” — это ваша внутренняя способность угадывать правильные решения, даже если вы не можете их объяснить. Эта карточка учит доверять себе, своему опыту и внутренним ощущениям. Она напоминает, что интуиция — это не магия, а результат наблюдений и знаний, которые помогают в самых неожиданных ситуациях.",
  },
  {
    name: "№26. Флокси — Не верить в себя",
    colorName: "Желтый.",
    description: "“Не верить в себя” — это чувство, когда вам кажется, что у вас ничего не получится. Эта карточка учит распознавать такие моменты, чтобы не позволять им управлять вами. Она напоминает, что каждый сталкивается с сомнениями, но важно помнить свои успехи, сильные стороны и продолжать двигаться вперед.",
  },
  {
    name: "№27. Флокси — Равнодушие",
    colorName: "Красный.",
    description: "“Равнодушие” символизирует состояние, когда вам всё равно на происходящее вокруг. Эта карточка учит осознавать, что равнодушие может ранить других людей и лишать нас важных моментов жизни. Она напоминает, что забота о других делает нас сильнее и помогает находить радость в общении.",
  },
  {
    name: "№28. Мими — Надёжность",
    colorName: "Зеленый.",
    description: "“Надежность” символизирует стабильность, верность и способность быть опорой для окружающих. Эта карточка учит важности выполнения обещаний, поддержания доверительных отношений и умения быть тем, на кого можно положиться.",
  },
  {
    name: "№29. Мими — Заболеть",
    colorName: "Желтый.",
    description: "“Заболеть” отражает моменты, когда организм ослаблен, а человек нуждается в заботе и внимании. Эта карточка учит уважать свои потребности, заботиться о здоровье и позволять себе отдых, когда это необходимо. Она также напоминает, как важно поддерживать близких в такие периоды.",
  },
  {
    name: "№30. Мими— Капризность",
    colorName: "Красный.",
    description: "“Капризность” отражает состояние, когда желания меняются стремительно, а настроение диктует действия. Эта карточка учит проявлять терпимость к эмоциям других и стараться находить баланс между своими желаниями и реальностью.",
  },
  {
    name: "№31. Макс — Чувство юмора",
    colorName: "Зеленый.",
    description: "“Чувство юмора” — это способность видеть позитивное даже в сложных ситуациях. Эта карточка напоминает, что смех и легкость помогают справляться с трудностями и находить общий язык с окружающими. Она вдохновляет на радость и искренние улыбки.",
  },
  {
    name: "№32. Макс — Буллинг",
    colorName: "Желтый.",
    description: "“Буллинг” показывает ситуации, когда кто-то подвергается насмешкам или обидам. Эта карточка учит сочувствию и напоминает, что важно защищать себя и других, создавая безопасное окружение. Она помогает осознать последствия таких ситуаций и их влияние на эмоциональное состояние.",
  },
  {
    name: "№33. Макс — Апатия",
    colorName: "Красный.",
    description: "“Апатия” символизирует потерю интереса и энергии. Эта карточка напоминает, что такие состояния временные, и важно искать способы вернуть радость и мотивацию. Она учит замечать свои чувства и работать с ними, находя внутренние ресурсы.",
  },
  {
    name: "№34. Розочка — Целеустремлённость",
    colorName: "Зеленый.",
    description: "“Целеустремленность” символизирует настойчивость и уверенность в достижении поставленных целей. Эта карточка напоминает о важности веры в себя и готовности преодолевать трудности ради мечты.",
  },
  {
    name: "№35. Розочка — Нуждаться в поддержке",
    colorName: "Желтый.",
    description: "“Нуждаться в поддержке” подчеркивает значимость заботы и участия близких в трудные моменты. Эта карточка учит открываться другим и принимать помощь, когда она необходима.",
  },
  {
    name: "№36. Розочка — Двуличность",
    colorName: "Красный.",
    description: "“Двуличность” показывает ситуации, когда внешнее поведение не совпадает с внутренними намерениями. Эта карточка учит искренности и честности в отношениях с собой и окружающими.",
  },
  {
    name: "№37. Клёпа — Искренность",
    colorName: "Зеленый.",
    description: "“Искренность” символизирует открытость и честность в чувствах. Эта карточка напоминает о важности быть самим собой, выражая свои эмоции и намерения без страха осуждения.",
  },
  {
    name: "№38. Клёпа — Потеряться",
    colorName: "Желтый.",
    description: "“Потеряться” отражает моменты растерянности и неуверенности. Эта карточка напоминает, что потерянность — временное состояние, и важно искать внутренние ориентиры и поддержку окружающих, чтобы вернуться к себе.",
  },
  {
    name: "№39. Клёпа — Жестокость",
    colorName: "Красный.",
    description: "“Жестокость” показывает моменты, когда мы причиняем вред или боль другим — физически или эмоционально. Эта карточка напоминает, что наши действия имеют последствия, и учит находить пути для выражения своих чувств, не причиняя вреда окружающим. Обсуждение этой карты может помочь детям понять, как важно быть чуткими и уважительными по отношению к другим, даже в сложные моменты.",
  },
  {
    name: "№40. Мариса — Дружелюбие",
    colorName: "Зеленый.",
    description: "“Дружелюбие” символизирует открытость и готовность к новым знакомствам. Эта карточка учит ценить искренность и стремление помогать другим. Она напоминает, что дружелюбие помогает укреплять связи и создавать теплую атмосферу в любой компании.",
  },
  {
    name: "№41. Мариса — Новенькая",
    colorName: "Желтый.",
    description: "“Новенькая” отражает моменты, когда вы оказываетесь в новой обстановке или окружении. Эта карточка учит адаптации, смелости и готовности открываться новому. Она напоминает, что каждый когда-то был “новеньким” и это лишь начало больших перемен.",
  },
  {
    name: "№42. Мариса — Высокомерие",
    colorName: "Красный.",
    description: "“Высокомерие” указывает на моменты, когда человек ставит себя выше других, чрезмерно гордится своими достижениями или игнорирует чужие чувства. Эта карточка учит ценить равенство и уважение, напоминая, что истинное достоинство проявляется через доброжелательность и внимание к окружающим.",
  },
  {
    name: "№43. Дедуля — Оптимизм",
    colorName: "Зеленый.",
    description: "“Оптимизм” отражает умение сохранять позитивное мышление даже в сложных обстоятельствах. Эта карточка вдохновляет на надежду, радость и уверенность в будущем. Она напоминает, что жизненные трудности можно преодолеть с верой в себя и поддержку близких.",
  },
  {
    name: "№44. Дедуля — Возрастные трудности",
    colorName: "Желтый.",
    description: "“Возрастные трудности” символизируют неизбежные изменения и сложности, которые приходят с возрастом. Эта карточка учит принимать эти изменения с достоинством, заботиться о своем физическом и эмоциональном состоянии и ценить мудрость, которая приходит с опытом.",
  },
  {
    name: "№45. Дедуля — Бестактность",
    colorName: "Красный.",
    description: "“Бестактность” указывает на ситуации, когда человек говорит или делает что-то, не учитывая чувства других. Эта карточка напоминает о важности уважения и эмпатии, а также о том, как важно быть внимательным к словам и поступкам, чтобы не ранить окружающих.",
  },
]